Revit 2026 API

# RailTransitionOption Enumeration

---

The transition type of the continuous rail.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RailTransitionOption
```
```vb
Public Enumeration RailTransitionOption
```
```cpp
public enum class RailTransitionOption
```
```fsharp
type RailTransitionOption
```

| Member name | Value | Description |
| --- | --- | --- |
| Gooseneck | 1 | Gooseneck. |
| None | 0 | No transition. |
| Simple | 2 | Simple |

#### Reference

Autodesk.Revit.DB.Architecture Namespace